&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ФИОКлиента = Параметры.ФИО;
КонецПроцедуры

//&НаКлиенте
//Процедура Отменить(Команда) 
//	Закрыть();	
//КонецПроцедуры

//&НаКлиенте
//Процедура СохранитьИОтправить(Команда)   
//	
//    // Проверка обязательных полей
//    Если ПустаяСтрока(Объект.Тема) Или ПустаяСтрока(Объект.Описание) Тогда
//        Сообщить("Тема и вопрос обращения обязательны для заполнения.");
//        Возврат; // Прерываем отправку
//	КонецЕсли;
//	
//    Успешно = СохранитьОбращениеНаСервере();

//	Если Успешно Тогда 
//		
//		//Сообщить("Обращение успешно отправлено!", СтатусСообщения.Важное);   

//        Закрыть(); 
//	//Иначе
//	//    Сообщить("Не удалось отправить обращение. Попробуйте позже.", СтатусСообщения.Важное);
//    КонецЕсли;
//	//Если Успешно Тогда
//	//	
//	//    Закрыть(); 
//	//КонецЕсли;
//    
//КонецПроцедуры




&НаКлиенте
Процедура СохранитьИОтправить(Команда)   

    //  Проверка обязательных полей
    Если ПустаяСтрока(Объект.Тема) Или ПустаяСтрока(Объект.Описание) Тогда
        Сообщить("Тема и описание обращения обязательны для заполнения.");
        // Не отправляем, не закрываем
        Возврат;
    КонецЕсли;

    Успешно = СохранитьОбращениеНаСервере();

    Если Успешно Тогда 
        // Передаём Истина в основную форму
        ЭтаФорма.Закрыть(Истина);
    Иначе
        Сообщить("Не удалось отправить обращение. Попробуйте позже.");
        // Закрываем без успеха
        ЭтаФорма.Закрыть(Успешно);
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда) 
    // Закрываем без результата
    Закрыть(Неопределено);	
КонецПроцедуры










&НаСервере
Функция СохранитьОбращениеНаСервере()
    
    // Создаем новый документ обращения   
    НовоеОбращение = Документы.ОбращенияВПоддержку.СоздатьДокумент();
    
    // Заполняем реквизиты документа
    НовоеОбращение.Тема = Объект.Тема;
    НовоеОбращение.Описание = Объект.Описание; 

    НовоеОбращение.КаналПоступления = Справочники.КаналыПоступления.НайтиПоНаименованию("Форма 1С"); 
    НовоеОбращение.Статус = Перечисления.СтатусыЗаявок.Новое;
	НовоеОбращение.Дата = ТекущаяДата();
	НовоеОбращение.ДатаСоздания = ТекущаяДата();
	НовоеОбращение.АвтоНазначениеОтветственного = Истина;
	//НовоеОбращение.ДатаСоздания = Дата('2025.11.26 10:45:25');
	//НовоеОбращение.Дата = Дата('2025.11.26 10:45:25');

	НовоеОбращение.Клиент = Объект.ФИОКлиента; 
	НовоеОбращение.Категория = Объект.Категория;
	НовоеОбращение.Приоритет = Объект.Приоритет;
	
	
	
	
	
	Json = Новый Структура;
	//Json.Вставить("title", "Медленная работа после обновления");
	//Json.Вставить("text", "1с "); 
	Json.Вставить("title", Объект.Тема);
	Json.Вставить("text", Объект.Описание);

	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, Json);
	Json = Запись.Закрыть();
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	
	Аутентификация = Новый Структура();
	Аутентификация.Вставить("Тип", "Bearer");
	//Аутентификация.Вставить("Токен", "06b1012380f980d6f3627c1b9375658e9385d39c5311b4fef312943409d999bd");
	Аутентификация.Вставить("Токен", Константы.Токен.Получить());	
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("Заголовки", Заголовки);
	ПараметрыЗапроса.Вставить("Аутентификация", Аутентификация);
	
	Ответ = КоннекторHTTP.Post(Константы.Сервер.Получить(), Json, ПараметрыЗапроса);
	Текстом = КоннекторHTTP.КакТекст(Ответ, "utf-8"); 
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Текстом);
	
	ОтветJSON = ПрочитатьJSON(Чтение);
		
	Данные = ОтветJSON.data; 
	КатегорияAI = Данные.category;
	ПриоритетAI = Данные.priority;
	
	Если НЕ ПустаяСтрока(КатегорияAI) Тогда
		
		КатегорияAI_Форматированная = ВРег(Лев(КатегорияAI, 1)) + НРег(Сред(КатегорияAI, 2));
			
		// Поиск по наименованию
		НайденнаяКатегория = Справочники.КатегорииОбращений.НайтиПоНаименованию(КатегорияAI_Форматированная);
		
		Если НЕ НайденнаяКатегория.Пустая() Тогда
			НовоеОбращение.Категория = НайденнаяКатегория;
		Иначе
			НовоеОбращение.Категория = "";
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПриоритетAI) Тогда 
		
		 ПриоритетAI_Форматированный = ВРег(Лев(ПриоритетAI, 1)) + НРег(Сред(ПриоритетAI, 2));   
		 
		Если ПриоритетAI_Форматированный = "Низкий" Тогда
			НайденныйПриоритет = Перечисления.Приоритет.Низкий; 
			
		ИначеЕсли ПриоритетAI_Форматированный = "Средний" Тогда
			НайденныйПриоритет = Перечисления.Приоритет.Средний;  
			
		ИначеЕсли ПриоритетAI_Форматированный = "Высокий" Тогда
			НайденныйПриоритет = Перечисления.Приоритет.Высокий;  
			
		Иначе
			НайденныйПриоритет = Неопределено;
		КонецЕсли;
		
		НовоеОбращение.Приоритет = НайденныйПриоритет;
	
	
	КонецЕсли;	
	
	
    // Добавляем первое сообщение в историю
    Если Не ПустаяСтрока(Объект.Описание) Тогда         
        НоваяСтрокаИстории = НовоеОбращение.ИсторияСообщений.Добавить();
        НоваяСтрокаИстории.ДатаВремя = ТекущаяДата();
        НоваяСтрокаИстории.Автор = "Клиент";
        НоваяСтрокаИстории.Текст = Объект.Описание;
    КонецЕсли;
    
    // Записываем документ
    Попытка
        НовоеОбращение.Записать();
		
        Возврат Истина;
    Исключение
        Сообщить("Ошибка при сохранении обращения: " + ОписаниеОшибки(), СтатусСообщения.Важное);
        Возврат Ложь;
    КонецПопытки;
    
КонецФункции



