&НаСервере
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если РежимЗаписи = РежимЗаписиДокумента.Запись
		И ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.Новое
		И (ЭтотОбъект.ВремяРеакцииРегламент = 0 ИЛИ ЭтотОбъект.ВремяРешенияРегламент = 0)
		И Не ПустаяСтрока(ЭтотОбъект.Категория) Тогда	
		ЗаполнитьВремяПоКатегории() 
	КонецЕсли;
    вр = ЭтотОбъект.ВремяРешенияРегламент;
	// При записи нового обращения запускается функция автоматического назначения ответственного
	// Если ответственный назначается вручную, то этв функция не вызываестя 
	// Функция НазначитьОтветственногоПоКомпетенциямИНагрузке написана в модуле менеджера в справочнике Сотрудники
	
    Если РежимЗаписи = РежимЗаписиДокумента.Запись 
		//И ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.Новое 
        И Не ПустаяСтрока(ЭтотОбъект.Категория)
		И Не ПустаяСтрока(ЭтотОбъект.Приоритет)
		И ЭтотОбъект.АвтоНазначениеОтветственного = Истина
		И ПустаяСтрока(Ответственный) Тогда
        
		//Ответственный = Справочники.Сотрудники.НазначитьОтветственногоПоКомпетенциямИНагрузке(ЭтотОбъект.Категория);
		//Если Ответственный <> Неопределено Тогда
		//    ЭтотОбъект.Ответственный = Ответственный;
		//КонецЕсли; 
		
		Ответственный = Справочники.Сотрудники.НазначитьОтветственногоПоКомпетенциямИНагрузке(ЭтотОбъект.Категория);
        Если Не ПустаяСтрока(Ответственный) Тогда
            ЭтотОбъект.Ответственный = Ответственный;
		Иначе 
			ЭтотОбъект.АвтоНазначениеОтветственного = Ложь;
		КонецЕсли;
		
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.Запись 
		//И ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.Новое 
        И ПустаяСтрока(ЭтотОбъект.Категория)
		И ПустаяСтрока(ЭтотОбъект.Приоритет)
		И ПустаяСтрока(Ответственный) Тогда
 
		ЭтотОбъект.АвтоНазначениеОтветственного = Ложь;
        
	КонецЕсли; 
		 
	//Если ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.Выполнено Тогда
	//    РежимПроведения = РежимЗаписиДокумента.Проведение;
	//КонецЕсли;
	
	//Если РежимЗаписи = РежимЗаписиДокумента.Запись 
	//    И ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.Выполнено Тогда
	//    
	//    // Устанавливаем флаг проведения
	//    Если РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
	//        РежимПроведения = РежимПроведенияДокумента.Проведение;
	//    КонецЕсли;
	//    
	//    // Можно добавить дополнительную проверку перед проведением
	//    Если ЭтотОбъект.Ответственный = Неопределено Тогда
	//        Сообщить("Внимание: обращение завершено, но ответственный не назначен!");
	//    КонецЕсли;
	//    
	//КонецЕсли;
	
	
	РассчитатьВремяРеакцииИРешения();

    
КонецПроцедуры


&НаСервере
Процедура ПриЗаписи(Отказ, РежимЗаписи)
    
    // Обновляем нагрузку в регистре сведений НагрузкаСотрудников  при записи документа
	//Если ЭтотОбъект.Ответственный <> Неопределено Тогда
	//    ОбновитьНагрузкуСотрудника(ЭтотОбъект.Ответственный);
	//КонецЕсли;  
	Если Не ПустаяСтрока(ЭтотОбъект.Ответственный) Тогда
        ОбновитьНагрузкуСотрудника(ЭтотОбъект.Ответственный);
	КонецЕсли; 
	
	//Если ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.Выполнено 
	//    И Не ЭтотОбъект.Проведен Тогда
	//    
	//    // Пытаемся провести документ
	//    Попытка
	//        ЭтотОбъект.Провести();
	//    Исключение
	//        // Логирование ошибки (опционально)
	//        // ЗаписьЖурналаРегистрации("Не удалось автоматически провести обращение: " + ОписаниеОшибки());
	//    КонецПопытки;
	//КонецЕсли;
	
КонецПроцедуры




&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
    
    // Обновляем нагрузку при смене ответственного   
	Если ЭтотОбъект.Статус <> Перечисления.СтатусыЗаявок.Выполнено Тогда
        
        ОбновитьНагрузкуСотрудника(ЭтотОбъект.Ответственный);
	КонецЕсли;
	
	//Если ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.ВРаботе 
	//    ИЛИ ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.КВыполнению Тогда
	//    
	//    ОбновитьНагрузкуСотрудника(ЭтотОбъект.Ответственный);
	//КонецЕсли;
    
КонецПроцедуры

//&НаСервере
//Процедура СтатусПриИзменении(Элемент) 
//    
//    // Обновляем нагрузку при изменении статуса
//	//Если ЭтотОбъект.Ответственный <> Неопределено Тогда
//	//    ОбновитьНагрузкуСотрудника(ЭтотОбъект.Ответственный);
//	//КонецЕсли;  
//	    
//КонецПроцедуры

&НаСервере
Процедура ОбновитьНагрузкуСотрудника(Сотрудник)
    
    Если Сотрудник = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
	ТекДата = НачалоДня(ТекущаяДата()); 
	//ТекДата = НачалоДня(Дата('2025.11.26 10:45:25')); 
    Нагрузка = РассчитатьТекущуюНагрузкуИзДокументов(Сотрудник, ТекДата);
    
    // Запись в регистр НагрузкаСотрудников
    НаборЗаписей = РегистрыСведений.НагрузкаСотрудников.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.Сотрудник.Установить(Сотрудник);
    НаборЗаписей.Отбор.Дата.Установить(ТекДата);
    НаборЗаписей.Прочитать();
    
    Если НаборЗаписей.Количество() > 0 Тогда
        // Обновление существующей записи
        Запись = НаборЗаписей[0];
    Иначе
        // Создание новой
        Запись = НаборЗаписей.Добавить();
        Запись.Сотрудник = Сотрудник;
        Запись.Дата = ТекДата;
    КонецЕсли;
    
    Запись.КоличествоОбращений = Нагрузка;
    НаборЗаписей.Записать();
    
КонецПроцедуры

&НаСервере
Функция РассчитатьТекущуюНагрузкуИзДокументов(Сотрудник, ТекДата)
    
    // В регистр записываются только новые обращения на текущую дату
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   COUNT(Обращения.Ссылка) КАК КоличествоОбращений
    |ИЗ
    |   Документ.ОбращенияВПоддержку КАК Обращения
    |ГДЕ
    |   Обращения.Ответственный = &Сотрудник
    |   И Обращения.Статус = &СтатусНовое
	|	И Обращения.Дата МЕЖДУ &НачалоДня И &КонецДня";
	

    Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("СтатусНовое", Перечисления.СтатусыЗаявок.Новое);
	Запрос.УстановитьПараметр("НачалоДня", ТекДата);
    Запрос.УстановитьПараметр("КонецДня", КонецДня(ТекДата));
	//Запрос.УстановитьПараметр("СтатусВРаботе", Перечисления.СтатусыЗаявок.ВРаботе);
	//Запрос.УстановитьПараметр("СтатусКВыполнению", Перечисления.СтатусыЗаявок.КВыполнению);
    
    Результат = Запрос.Выполнить().Выбрать();
    Если Результат.Следующий() Тогда
        Возврат Результат.КоличествоОбращений;
    Иначе
        Возврат 0;
    КонецЕсли;
    
КонецФункции  



&НаСервере
Процедура РассчитатьВремяРеакцииИРешения()
	
    ТекущееВремя = ТекущаяДата();
    
    // Время реакции рассчитывается когда обращение переходит в статус ВРаботе или КВыполнению
    Если (ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.ВРаботе 
        ИЛИ ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.КВыполнению)
        И (ЭтотОбъект.ВремяРеакцииФакт = Неопределено ИЛИ ЭтотОбъект.ВремяРеакцииФакт = 0) Тогда
        
        // Разница между текущим временем и датой создания
        РазницаВремени = ТекущееВремя - ЭтотОбъект.ДатаСоздания;
        ЭтотОбъект.ВремяРеакцииФакт = РазницаВремени;
    КонецЕсли;
    
	// Время решения рассчитывается когда обращение Выполнено
	Если ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.Выполнено
	    И (ЭтотОбъект.ВремяРешенияФакт = Неопределено ИЛИ ЭтотОбъект.ВремяРешенияФакт = 0) Тогда
	    
	    // Разница между текущим временем и датой создания (секунды)
	    РазницаВремени = ТекущееВремя - ЭтотОбъект.ДатаСоздания;
	    ЭтотОбъект.ВремяРешенияФакт = РазницаВремени;
	КонецЕсли;
    
КонецПроцедуры

 


&НаСервере
Процедура ЗаполнитьВремяПоКатегории()
    
    Если ЭтотОбъект.Категория = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    // Получаем данные из справочника КатегорииОбращений
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   КатегорииОбращений.ВремяРеакции КАК ВремяРеакции,
    |   КатегорииОбращений.ВремяРешения КАК ВремяРешения
    |ИЗ
    |   Справочник.КатегорииОбращений КАК КатегорииОбращений
    |ГДЕ
    |   КатегорииОбращений.Ссылка = &Категория";
    
    Запрос.УстановитьПараметр("Категория", ЭтотОбъект.Категория);
    
    Результат = Запрос.Выполнить().Выбрать();
    Если Результат.Следующий() Тогда
        // Заполняем реквизиты времени
        ЭтотОбъект.ВремяРеакцииРегламент = Результат.ВремяРеакции;
        ЭтотОбъект.ВремяРешенияРегламент = Результат.ВремяРешения;
        
        // Рассчитываем даты "Принять до" и "Решить до"
		//РассчитатьСрокиОбработки();
	КонецЕсли;
	
	// Рассчитываем "Принять до" (дата создания + время реакции)
            
    ЭтотОбъект.ПринятьДо = ЭтотОбъект.Дата + (ЭтотОбъект.ВремяРеакцииРегламент * 3600); 
	ЭтотОбъект.РешитьДо = ЭтотОбъект.Дата + (ЭтотОбъект.ВремяРешенияРегламент * 3600);	
        
    
    
КонецПроцедуры

//&НаСервере
//Процедура РассчитатьСрокиОбработки()
//    
//    Если Объект.ТекущееОбращение.Дата = Неопределено Тогда
//        Возврат;
//    КонецЕсли;
//    
//    // Рассчитываем "Принять до" (дата создания + время реакции)
//    Если Объект.ТекущееОбращение.ВремяРеакции <> Неопределено 
//        И Объект.ТекущееОбращение.ВремяРеакции > 0 Тогда
//        
//        Объект.ПринятьДо = Объект.ТекущееОбращение.Дата + (Объект.ТекущееОбращение.ВремяРеакции * 3600); 
//		
//    КонецЕсли;
//    
//    // Рассчитываем "Решить до" (дата создания + время решения)
//    Если Объект.ТекущееОбращение.ВремяРешения <> Неопределено 
//        И Объект.ТекущееОбращение.ВремяРешения > 0 Тогда
//        
//        Объект.РешитьДо = Объект.ТекущееОбращение.Дата + (Объект.ТекущееОбращение.ВремяРешения * 3600);
//    КонецЕсли;
//    
//КонецПроцедуры




//"ВЫБРАТЬ
//    |   COUNT(Обращения.Ссылка) КАК КоличествоОбращений
//    |ИЗ
//    |   Документ.ОбращенияВПоддержку КАК Обращения
//    |ГДЕ
//    |   Обращения.Ответственный = &Сотрудник
//    |   И (Обращения.Статус = &СтатусНовое
//	|		ИЛИ Обращения.Статус = &СтатусВРаботе 
//    |       	ИЛИ Обращения.Статус = &СтатусКВыполнению)";
