&НаКлиенте
Процедура ПриОткрытии(Отказ)    ОбновитьДанные();КонецПроцедуры&НаСервереПроцедура ОбновитьДанные()    Запрос = Новый Запрос("ВЫБРАТЬ
                          |	ОбращенияВПоддержку.Номер КАК Номер,
                          |	ОбращенияВПоддержку.Тема КАК Тема,
                          |	ОбращенияВПоддержку.Ответственный КАК Ответственный,
                          |	ОбращенияВПоддержку.Категория КАК Категория,
                          |	ОбращенияВПоддержку.Приоритет КАК Приоритет,
                          |	ОбращенияВПоддержку.Статус КАК Статус,
                          |	ОбращенияВПоддержку.Ссылка КАК Ссылка
                          |ИЗ
                          |	Документ.ОбращенияВПоддержку КАК ОбращенияВПоддержку");	
	Таблица_Новое = Объект.Таблица_Новое;  
	Таблица_КВыполнению = Объект.Таблица_КВыполнению;
	Таблица_ВРаботе = Объект.Таблица_ВРаботе;
	Таблица_ВОжидании = Объект.Таблица_ВОжидании;
	Таблица_Выполнено = Объект.Таблица_Выполнено;
	
	Таблица_Новое.Очистить();
	Таблица_КВыполнению.Очистить();
	Таблица_ВРаботе.Очистить();
	Таблица_ВОжидании.Очистить();
	Таблица_Выполнено.Очистить();
	    Результат = Запрос.Выполнить();    Выборка = Результат.Выбрать();    	Пока Выборка.Следующий() Цикл         
		Если Выборка.Статус = Перечисления.СтатусыЗаявок.Новое Тогда
			НоваяСтрока = Таблица_Новое.Добавить();
		ИначеЕсли Выборка.Статус = Перечисления.СтатусыЗаявок.КВыполнению Тогда
			НоваяСтрока = Таблица_КВыполнению.Добавить();  
		ИначеЕсли Выборка.Статус = Перечисления.СтатусыЗаявок.ВОжидании Тогда
			НоваяСтрока = Таблица_ВОжидании.Добавить();
		ИначеЕсли Выборка.Статус = Перечисления.СтатусыЗаявок.ВРаботе Тогда
			НоваяСтрока = Таблица_ВРаботе.Добавить();
		ИначеЕсли Выборка.Статус = Перечисления.СтатусыЗаявок.Выполнено Тогда
			НоваяСтрока = Таблица_Выполнено.Добавить(); 
		КонецЕсли;                     
		НоваяСтрока.Номер = Выборка.Номер;
		НоваяСтрока.Тема = Выборка.Тема;
		НоваяСтрока.Приоритет = Выборка.Приоритет;
		НоваяСтрока.Ответственный = Выборка.Ответственный;  
		НоваяСтрока.Категория = Выборка.Категория;
		НоваяСтрока.СсылкаНаОбращение = Выборка.Ссылка;    КонецЦикла;    КонецПроцедуры  

&НаКлиенте
Процедура ОбновитьСписок(Команда)
    ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНовоеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//Номер = Элемент.ТекущиеДанные.Номер;
	//НажатиеНаСтроку(Номер);	
	//ОбновитьДанные();
	СсылкаНаОбращение = Элемент.ТекущиеДанные.СсылкаНаОбращение;
    ОткрытьФормуПросмотра(СсылкаНаОбращение);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПросмотра(СсылкаНаОбращение)
	
	// В самой форме ФормаПросмотра нужно задать параметр с таким же именем "ПараметрФормыПросмотра" 
    ПараметрыФормы = Новый Структура("ПараметрФормыПросмотра", СсылкаНаОбращение);
    
    ОткрытьФорму("Обработка.ФормаПросмотраОбращенияОператора2.Форма.ФормаПросмотра",
				  ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
    
КонецПроцедуры
   

&НаСервере
Процедура НажатиеНаСТрокуВниз(Номер)                     
	ВыбранныйНомер = Номер;
    ДокументОбъект = Документы.ОбращенияВПоддержку.НайтиПоНомеру(ВыбранныйНомер);
    
    Документ = ДокументОбъект.ПолучитьОбъект();
	
	ТекущийСтатус = Документ.Статус;
    НовыйСтатус = Перечисления.СтатусыЗаявок.Новое;
	
    Если ТекущийСтатус = Перечисления.СтатусыЗаявок.Новое Тогда
		НовыйСтатус = Перечисления.СтатусыЗаявок.КВыполнению;
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыЗаявок.КВыполнению Тогда
		НовыйСтатус = Перечисления.СтатусыЗаявок.ВРаботе;  
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыЗаявок.ВРаботе Тогда
		НовыйСтатус = Перечисления.СтатусыЗаявок.ВОжидании;
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыЗаявок.ВОжидании Тогда
		НовыйСтатус = Перечисления.СтатусыЗаявок.Выполнено;
	КонецЕсли; 	  
	
    Документ.Статус = НовыйСтатус;    
    Документ.Записать();
КонецПроцедуры 

&НаСервере
Процедура НажатиеНаСТрокуВверх(Номер)                     
	ВыбранныйНомер = Номер;
    ДокументОбъект = Документы.ОбращенияВПоддержку.НайтиПоНомеру(ВыбранныйНомер);
    
    Документ = ДокументОбъект.ПолучитьОбъект();
	
	ТекущийСтатус = Документ.Статус;
    НовыйСтатус = Перечисления.СтатусыЗаявок.Выполнено;
	
    Если ТекущийСтатус = Перечисления.СтатусыЗаявок.КВыполнению Тогда
		НовыйСтатус = Перечисления.СтатусыЗаявок.Новое;  
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыЗаявок.ВРаботе Тогда
		НовыйСтатус = Перечисления.СтатусыЗаявок.КВыполнению;
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыЗаявок.ВОжидании Тогда
		НовыйСтатус = Перечисления.СтатусыЗаявок.ВРаботе; 
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыЗаявок.Выполнено Тогда
		НовыйСтатус = Перечисления.СтатусыЗаявок.ВОжидании;
	КонецЕсли; 	  
	
    Документ.Статус = НовыйСтатус;    
    Документ.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВОжиданииВверх(Команда)
	ТекущиеДанные = ЭтаФорма.Элементы.ТаблицаВОжидании.ТекущиеДанные;	
	Номер = ТекущиеДанные.Номер;
	НажатиеНаСТрокуВверх(Номер);	
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВОжиданииВниз(Команда)
	ТекущиеДанные = ЭтаФорма.Элементы.ТаблицаВОжидании.ТекущиеДанные;	
	Номер = ТекущиеДанные.Номер;
	НажатиеНаСТрокуВниз(Номер);	
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВРаботеВверх(Команда)
	ТекущиеДанные = ЭтаФорма.Элементы.ТаблицаВРаботе.ТекущиеДанные;	
	Номер = ТекущиеДанные.Номер;
	НажатиеНаСТрокуВверх(Номер);	
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВРаботеВниз(Команда)
	ТекущиеДанные = ЭтаФорма.Элементы.ТаблицаВРаботе.ТекущиеДанные;	
	Номер = ТекущиеДанные.Номер;
	НажатиеНаСТрокуВниз(Номер);	
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВыполненоВверх(Команда)
	ТекущиеДанные = ЭтаФорма.Элементы.ТаблицаВыполнено.ТекущиеДанные;	
	Номер = ТекущиеДанные.Номер;
	НажатиеНаСТрокуВверх(Номер);	
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВыполненоВниз(Команда)
	ТекущиеДанные = ЭтаФорма.Элементы.ТаблицаВыполнено.ТекущиеДанные;	
	Номер = ТекущиеДанные.Номер;
	НажатиеНаСТрокуВниз(Номер);	
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиКВыполнениюВверх(Команда)
	ТекущиеДанные = ЭтаФорма.Элементы.ТаблицаКВыполнению.ТекущиеДанные;	
	Номер = ТекущиеДанные.Номер;
	НажатиеНаСТрокуВверх(Номер);	
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиКВыполнениюВниз(Команда)
	ТекущиеДанные = ЭтаФорма.Элементы.ТаблицаКВыполнению.ТекущиеДанные;	
	Номер = ТекущиеДанные.Номер;
	НажатиеНаСТрокуВниз(Номер);	
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиНовоеВверх(Команда)
    ТекущиеДанные = ЭтаФорма.Элементы.ТаблицаНовое.ТекущиеДанные;	
	Номер = ТекущиеДанные.Номер;
	НажатиеНаСТрокуВверх(Номер);	
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиНовоеВниз(Команда)
	ТекущиеДанные = ЭтаФорма.Элементы.ТаблицаНовое.ТекущиеДанные;	
	Номер = ТекущиеДанные.Номер;
	НажатиеНаСТрокуВниз(Номер);	
	ОбновитьДанные();
КонецПроцедуры
