//&НаКлиенте
//Процедура СоздатьНовоеОбращение(Команда)
//    ОткрытьФормуСозданияОбращения();
//КонецПроцедуры 
&НаКлиенте
Процедура СоздатьНовоеОбращение(Команда)
    
    ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияФормыСозданияОбращения", ЭтотОбъект);
    
    ПараметрыФИО = Новый Структура("ФИО", Объект.ФИО);
    
    ОткрытьФорму("Обработка.ФормаСозданияОбращенияКлиента1.Форма.ФормаСозданияОбращения",
                  ПараметрыФИО,,,,, ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  


    
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПослеЗакрытияФормыСозданияОбращения(РезультатЗакрытия, ПараметрыОповещения) Экспорт 
    
    Если РезультатЗакрытия = Неопределено Тогда
        // Форма была закрыта без создания обращения (например, нажата отмена)
        Возврат;
    КонецЕсли;
    
    Если РезультатЗакрытия = Истина Тогда
        Сообщить("Обращение успешно отправлено!", СтатусСообщения.Обычное);
        // Обновление списка обращений
        ОбновитьСписокОбращенийНаСервере();
    Иначе
        Сообщить("Ошибка при создании обращения!", СтатусСообщения.Ошибка);
    КонецЕсли;
    
КонецПроцедуры














//&НаКлиенте
//Процедура ОткрытьФормуСозданияОбращения() 
//	ПараметрыФИО = Новый Структура("ФИО", Объект.ФИО);
//	
//    ОткрытьФорму("Обработка.ФормаСозданияОбращенияКлиента1.Форма.ФормаСозданияОбращения",
//	              ПараметрыФИО,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//КонецПроцедуры 


&НаКлиенте
Процедура ОбновитьСписок(Команда)
    ОбновитьСписокОбращенийНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокОбращенийНаСервере()
 
    Объект.СписокОбращений.Очистить();
    
	//ОбъектТекущийПользователь = Объект.ФИО; //Получаем объект из справочника со всеми реквизитами (наименование, email, телефон и тд)
	//ТекущийПользователь = ОбъектТекущийПользователь.Наименование; // Берем только резвизит Наименование (тип строка, здесь ФИО клиента)
	
	//ОбъектТекущийПользователь = Объект.ФИО; //Получаем объект из справочника со всеми реквизитами (наименование, email, телефон и тд)
	ТекущийПользователь = Объект.ФИО; // Берем только резвизит Наименование (тип строка, здесь ФИО клиента)

	
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    ОбращенияВПоддержку.Ссылка,
    |    ОбращенияВПоддержку.Тема,
    |    ОбращенияВПоддержку.Статус,
    |    ОбращенияВПоддержку.Дата,
    |    ОбращенияВПоддержку.Номер
    |ИЗ
    |    Документ.ОбращенияВПоддержку КАК ОбращенияВПоддержку
    |ГДЕ
    |    ОбращенияВПоддержку.Клиент = &ТекущийПользователь
    |УПОРЯДОЧИТЬ ПО
    |    Дата УБЫВ";
    
    Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
    
    РезультатЗапроса = Запрос.Выполнить().Выбрать();
    
    Пока РезультатЗапроса.Следующий() Цикл
        НоваяСтрока = Объект.СписокОбращений.Добавить(); 

        НоваяСтрока.Ссылка = РезультатЗапроса.Ссылка;
        НоваяСтрока.Тема = РезультатЗапроса.Тема;
        НоваяСтрока.Статус = РезультатЗапроса.Статус;
        НоваяСтрока.Дата = РезультатЗапроса.Дата;
        НоваяСтрока.Номер = РезультатЗапроса.Номер;
    КонецЦикла;
    
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьОбращение(Команда)
	
	// Получаем ссылку на выбранное обращение
 	ТекущиеДанные = ЭтаФорма.Элементы.СписокОбращений.ТекущиеДанные;  
    СсылкаНаОбращение = ТекущиеДанные.Ссылка;
	
    ОткрытьФормуПросмотра(СсылкаНаОбращение);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПросмотра(СсылкаНаОбращение)
	
	// В самой форме ФормаПросмотра нужно задать параметр с таким же именем "ПараметрФормыПросмотра" 
    ПараметрыФормы = Новый Структура("ПараметрФормыПросмотра", СсылкаНаОбращение);
    
    ОткрытьФорму("Обработка.ФормаПросмотраОбращенияКлиента1.Форма.ФормаПросмотра",
				  ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
    
КонецПроцедуры

&НаСервере
Функция ПолучитьИмя()  
	Имя = ПолноеИмяПользователя();
	Возврат Имя
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИмяТекущПольз = ПолучитьИмя();
	Объект.ФИО = ИмяТекущПольз;
	ОбновитьСписокОбращенийНаСервере();
КонецПроцедуры








