// Модуль менеджера справочника Сотрудники
Функция НазначитьОтветственногоПоКомпетенциямИНагрузке(КатегорияОбращения) Экспорт

    ТекущаяДата = ТекущаяДата();

    Запрос = Новый Запрос;
    Запрос.Текст = 	
	"ВЫБРАТЬ ПЕРВЫЕ 1
    |   Сотрудники.Ссылка КАК Сотрудник,
    |   ЕСТЬNULL(Нагрузка.ОставшаясяНагрузкаВЧасах, 0) КАК ОставшаясяНагрузкаВЧасах
    |ИЗ
    |   Справочник.Сотрудники КАК Сотрудники
    |   ЛЕВОЕ СОЕДИНЕНИЕ (
    |       ВЫБРАТЬ
    |           Обращения.Ответственный,
    |           СУММА(
    |               ВЫБОР
    |                   КОГДА (Обращения.ВремяРешенияРегламент * 3600 - 
    |                         (РАЗНОСТЬДАТ(Обращения.Дата, &ТекущаяДата, СЕКУНДА))) > 0
    |                   ТОГДА (Обращения.ВремяРешенияРегламент * 3600 - 
    |                         (РАЗНОСТЬДАТ(Обращения.Дата, &ТекущаяДата, СЕКУНДА)))
    |                   ИНАЧЕ 0
    |               КОНЕЦ
    |           ) КАК ОставшаясяНагрузкаВЧасах
    |       ИЗ
    |           Документ.ОбращенияВПоддержку КАК Обращения
    |       ГДЕ
    |           Обращения.Статус В (&АктивныеСтатусы)
    |           И Обращения.Ответственный <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
    |       СГРУППИРОВАТЬ ПО
    |           Обращения.Ответственный
    |   ) КАК Нагрузка
    |   ПО Сотрудники.Ссылка = Нагрузка.Ответственный
    |ГДЕ
    |   Сотрудники.Компетенции.Категория = &КатегорияОбращения
    |   И Сотрудники.ПометкаУдаления = ЛОЖЬ
    |УПОРЯДОЧИТЬ ПО
    |   ОставшаясяНагрузкаВЧасах";


    АктивныеСтатусы = Новый Массив;
    АктивныеСтатусы.Добавить(Перечисления.СтатусыЗаявок.Новое);
    АктивныеСтатусы.Добавить(Перечисления.СтатусыЗаявок.КВыполнению);
    АктивныеСтатусы.Добавить(Перечисления.СтатусыЗаявок.ВРаботе);
    АктивныеСтатусы.Добавить(Перечисления.СтатусыЗаявок.ВОжидании);  

    Запрос.УстановитьПараметр("АктивныеСтатусы", АктивныеСтатусы);
    Запрос.УстановитьПараметр("КатегорияОбращения", КатегорияОбращения);
    Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата);

    Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		а = Результат.ОставшаясяНагрузкаВЧасах / 3600;
        Возврат Результат.Сотрудник;
    Иначе
        // Резерв: любой сотрудник с компетенцией
		//у = НайтиЛюбогоСотрудникаСКомпетенцией(КатегорияОбращения);
        Возврат НайтиЛюбогоСотрудникаСКомпетенцией(КатегорияОбращения);
	КонецЕсли;
	
КонецФункции



Функция НайтиЛюбогоСотрудникаСКомпетенцией(КатегорияОбращения)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ ПЕРВЫЕ 1
    |   Сотрудники.Ссылка КАК Сотрудник
    |ИЗ
    |   Справочник.Сотрудники КАК Сотрудники
    |ГДЕ
    |   Сотрудники.Компетенции.Категория = &КатегорияОбращения";
    
    Запрос.УстановитьПараметр("КатегорияОбращения", КатегорияОбращения);
    
    Результат = Запрос.Выполнить().Выбрать();
    Если Результат.Следующий() Тогда
        Возврат Результат.Сотрудник;
    Иначе
        Возврат Неопределено;
    КонецЕсли;
    
КонецФункции